{
  "allow-flight": "Lehetővé teszi a felhasználók számára, hogy túlélési módban használhassák a repülést a szerveren, ha olyan mod van telepítve, amely lehetővé teszi a repülést. A repülés engedélyezése esetén a gyászolók gyakoribbá válhatnak, mert ez megkönnyíti a munkájukat. Kreatív mód, ennek nincs hatása.<br><br>false – A repülés nem engedélyezett (a legalább 5 másodpercig levegőben lévő játékosok kirúgást kapnak).<br>true – A repülés megengedett, és akkor használható, ha a játékosnak van légy mod telepítve.",
  "allow-nether": "Lehetővé teszi a játékosok számára, hogy a Nether-re utazzanak.false - A Nether portálok nem működnek.<br>true - A szerver lehetővé teszi, hogy a portálok játékosokat küldjenek a Netherbe.",
  "broadcast-console-to-ops": "Konzolparancs kimenetek küldése az összes online operátornak.",
  "broadcast-rcon-to-ops": "Rcon console parancskimenetek küldése az összes online operátornak.",
  "nehézség": "Meghatározza a szerver nehézségét (például a csőcselék által okozott sebzést, valamint azt, hogy az éhség és méreg milyen hatással van a játékosokra). Ha egy örökölt nehézségi szám van megadva, a rendszer csendben nehézségi névvé alakítja.<br><br> >békés (0)<br>könnyű (1)<br>normál (2)<br>kemény (3)",
  "enable-command-block": "Engedélyezi a parancsblokkokat",
  "enable-jmx-monitoring": "Megmutat egy MBean-t net.minecraft.server:type=Server objektumnévvel és két attribútummal: átlagTickTime és tickTimes, ezredmásodpercben megadva a tick időket. A JMX Java futtatókörnyezeten való engedélyezéséhez is szüksége van hogy adjunk hozzá néhány JVM jelzőt az indításhoz az itt leírtak szerint.",
  "enable-rcon": "Lehetővé teszi a kiszolgálókonzol távoli elérését. Nem ajánlott az RCON-t kitenni az Internetre, mert az RCON protokoll mindent titkosítás nélkül továbbít. Minden (beleértve az RCON jelszót is), ami az RCON szerver és a kliens között kommunikál, kiszivároghat valaki figyel a kapcsolatodra.",
  "enable-status": "A kiszolgálót onlineként jeleníti meg a szerverlistán. Ha hamisra állítja, akkor elnyomja a kliensek válaszait. Ez azt jelenti, hogy offlineként jelenik meg, de továbbra is fogadja a kapcsolatokat.",
  "enable-query": "Engedélyezi a GameSpy4 protokoll szerver figyelőjét. A szerverrel kapcsolatos információk beszerzésére szolgál.",
  "enforce-secure-profile": "Ha igazra van állítva, a Mojang által aláírt nyilvános kulccsal nem rendelkező játékosok nem tudnak csatlakozni a szerverhez.",
  "enforce-whitelist": "Kényszeríti az engedélyezési listát a kiszolgálón. Ha ez az opció be van kapcsolva, akkor az engedélyezőlistán nem szereplő felhasználók (ha engedélyezve van) kikerülnek a szerverről, miután a szerver újratölti az engedélyezőlista fájlt.<br>< br>false – Egyetlen felhasználót sem rúgnak ki, ha nem szerepel az engedélyezőlistán.<br>igaz – Az engedélyezőlistán nem szereplő online felhasználókat kirúgják.",
  "entity-broadcast-range-percentage": "Szabályozza, hogy az entitásoknak milyen közel kell lenniük, mielőtt elküldik őket az ügyfeleknek. A magasabb értékek azt jelentik, hogy távolabbról jelennek meg, ami potenciálisan több késést okozhat. Ez az alapértelmezett érték százalékában van kifejezve. . Például, ha 50-re állítja, akkor fele a szokásos érték lesz. Ez utánozza a kliens videóbeállításainak funkcióját (nem ellentétben a Render Distance funkcióval, amelyet a kliens személyre szabhat, amíg az a szerver beállításai alatt van).",
  "force-gamemode": "Kényszerítse a játékosokat, hogy csatlakozzanak az alapértelmezett játékmódhoz.false - A játékosok abba a játékmódba csatlakoznak, amelyben elhagyták.<br>true - A játékosok mindig az alapértelmezett játékmódban csatlakoznak.",
  "function-permission-level": "Beállítja az alapértelmezett engedélyszintet a funkciókhoz. A 4 szint részleteiért lásd az engedélyszintet.",
  "gamemode": "Meghatározza a játékmódot. Ha meg van adva egy örökölt játékmód szám, akkor az csendben játékmódnévvé alakul.<br>túlélés (0)<br>kreatív (1)<br>kaland (2)< br>néző (3)",
  "generate-structures": "Meghatározza, hogy létrehozhatók-e struktúrák (például falvak) ez hamisra van állítva.",
  "generator-settings": "A világgenerálás testreszabásához használt beállítások. Kövesse a formátumát, és írja be a megfelelő JSON karakterláncot.",
  "hardcore": "Ha igazra van állítva, a szerver nehézségeit figyelmen kívül hagyja, és keményre állítja, és a játékosok néző módba kerülnek, ha meghalnak.",
  "hide-online-players": "Ha igazra van állítva, a rendszer nem küld játékoslistát az állapotkérésekre.",
  "initial-disabled-packs": "Azok az adatcsomagok vesszővel elválasztott listája, amelyeket nem kell automatikusan engedélyezni a világ létrehozásakor.",
  "initial-enabled-packs": "A világ létrehozása során engedélyezendő adatcsomagok vesszővel elválasztott listája. A funkciócsomagokat kifejezetten engedélyezni kell.",
  "level-name": "A szintnév érték a világ neve és a mappa neve. A játékos ide is másolhatja a mentett játékmappáját, és megváltoztathatja a nevet a mappaéval megegyezőre, hogy betöltse helyette. Karakterek például: (aposztróf) lehet, hogy ki kell hagyni egy fordított perjel hozzáadásával.",
  "level-seed": "Világmagot állít be a játékos világának, mint a Singleplayerben. A világ véletlenszerű maggal generál, ha üresen hagyja. Néhány példa: minecraft, 404, 1a2b3c.",
  "level-type": "Meghatározza a generált világbeállítást. Világos előre beállított azonosító használatakor a kilépésre van szükség, és a vanília világ előre beállított azonosítójának névtere (minecraft:) elhagyható.<br><br>minecraft:normal - Szabványos világ dombokkal, völgyekkel, vízzel stb.<br>minecraft:flat – Lapos világ jellemzők nélkül, módosítható generátorbeállításokkal.<br>minecraft:large_biomes – Ugyanaz, mint az alapértelmezett, de minden életközösség nagyobb.< br>minecraft:amplified - Ugyanaz, mint az alapértelmezett, de a világgenerációs magasságkorlát meg van növelve.<br>minecraft:single_biome_surface - A svédasztalos világ, amelyben az egész túlvilág egyetlen életközösségből áll, módosítható generátorbeállításokkal.<br>büfé - Csak 1,15-höz vagy korábbihoz. Ugyanaz, mint az alapértelmezett, kivéve, ha a generátor-beállítások be vannak állítva.<br>default_1_1 - Csak 1,15-höz vagy korábbihoz. Ugyanaz, mint az alapértelmezett, de más világtípusnak számít.<br>testreszabott - Csak 1,15-höz vagy korábbihoz. 1.13 után ez az érték nem különbözik az alapértelmezetttől, de az 1.12-ben és az előttiekben már használható teljes cust létrehozására ó világ.",
  "max-chained-neighbor-updates": "A szomszédos egymást követő frissítések számának korlátozása a további frissítések kihagyása előtt. A negatív értékek megszüntetik a korlátot.",
  "max-players": "A játékosok maximális száma, akik egyszerre játszhatnak a szerveren. Vegye figyelembe, hogy a szerveren több játékos több erőforrást fogyaszt. Vegye figyelembe azt is, hogy az operatív játékos kapcsolatok nem számítanak bele a maximális játékosok számába, de az ops jelenleg nem tud csatlakozni egy teljes szerverhez. Ezt azonban meg lehet változtatni, ha a lejátszó szerverkönyvtárában az ops.json nevű fájlba lép, megnyitja, megkeresi a módosítani kívánt műveletet, és módosítja a bypassesPlayerLimit nevű beállítást a következőre: igaz (az alapértelmezés false). Ez azt jelenti, hogy az adott műveletnek nem kell megvárnia egy játékos távozását, hogy csatlakozzon. A mező rendkívül nagy értékei a kliensoldali felhasználói lista megszakadását eredményezik.",
  "max-tick-time": "Maximálisan hány ezredmásodperc telhet el, amíg a kiszolgálófigyelő leállítja a szervert az üzenettel. Egyszeri kiszolgáló tick 60,00 másodpercig tartott (legfeljebb 0,05 lehet); tekintve, hogy összeomlott, A szerver kényszerített leállásra kerül. Ha ez a feltétel teljesül, meghívja a System.exit(1) parancsot.-1 - a watchdog teljes letiltása (ez a letiltási lehetőség a 14w32a-ban került hozzáadásra)",
  "max-world-size": "Ez beállítja a maximális lehetséges méretet blokkokban, sugárban kifejezve, amit a világhatár elérhet. A világhatár nagyobbra állításával a parancsok sikeresen befejeződnek, de a tényleges határ nem mozdul el ezen Ha a maximális világméretet az alapértelmezettnél magasabbra állítja, az nem jelent semmit.Példák: <br><br>Ha a maximális világméretet 1000-re állítja, a játékos 2000 × 2000-es világhatárt kap. <br>Ha a maximális világméretet 4000-re állítja, a játékos 8000×8000-es világhatárt ad.",
  "motd": "Ez az üzenet jelenik meg a kliens szerverlistájában, a név alatt. A MOTD támogatja a szín- és formázási kódokat.<br>A MOTD támogatja a speciális karaktereket, például a szíveket. Az ilyen karaktereknek azonban kötelező konvertálható megtisztított Unicode formává. Itt található egy online konverter.<br>Ha a MOTD meghaladja az 59 karaktert, a szerverlista kommunikációs hibát jelezhet.",
  "network-compression-threshold": "Alapértelmezés szerint lehetővé teszi, hogy az n-1 bájt nagyságú csomagok normálisan menjenek, de egy n bájt vagy annál nagyobb csomag le lesz tömörítve. Tehát az alacsonyabb szám nagyobb tömörítést jelent, de kis mennyiségű csomag tömörítését A bájtok valóban nagyobb eredményt kaphatnak, mint ami bekerült.-1 - a tömörítés teljes letiltása<br>0 - mindent tömörít<br>Megjegyzés: Az Ethernet specifikáció megköveteli, hogy a 64 bájtnál kisebb csomagokat 64 bájtra töltsék ki. Előfordulhat, hogy 64-nél alacsonyabb érték beállítása nem előnyös. Az MTU túllépése sem ajánlott, általában 1500 bájt.",
  "online-mode": "A szerver ellenőrzi a játékosok csatlakozását a Minecraft fiók adatbázisával. Csak akkor állítsd false értékre, ha a játékos szervere nem csatlakozik az internethez. Hamis fiókkal rendelkező hackerek csatlakozhatnak, ha ez false! Ha a minecraft.net le vagy nem érhető el, egyetlen játékos sem tud csatlakozni, ha ez igaz értékre van állítva. Ennek a változónak a szándékos kikapcsolását a szerver feltörésének nevezzük, a kikapcsolt online módban lévő szervereket pedig feltört szervereknek, lehetővé téve a Minecraft engedély nélküli példányával rendelkező játékosok csatlakozását. .true - Engedélyezve. A szerver feltételezi, hogy rendelkezik internetkapcsolattal, és minden csatlakozó játékost ellenőrz.<br>false - Letiltva. A szerver nem próbálja meg ellenőrizni a csatlakozó játékosokat.",
  "op-permission-level": "Beállítja az alapértelmezett engedélyszintet a műveletekhez az /op. használatakor",
  "player-idle-timeout": "Ha nem nulla, akkor a játékosokat kirúgják a szerverről, ha ennyi percnél tovább tétlenek.Megjegyzés: Az üresjárati idő visszaáll, amikor a szerver megkapja a következő csomagok egyikét:<br> Kattintson az ablakra<br>Elem bűvölése<br>Frissítési jel<br>Játékos ásás<br>Játékos blokk elhelyezése<br>Tartott elem módosítása<br>Animáció (lengőkar)<br>Entitásművelet<br>Kliens állapota<br> Csevegési üzenet<br>Entitás használata",
  "prevent-proxy-connections": "Ha a szerverről küldött ISP/AS eltér a Mojang Studios hitelesítési szerverétől, akkor a lejátszó ki van rúgva.",
  "previews-chat": "Ha igazra van állítva, a csevegés előnézete engedélyezve lesz.true - Engedélyezve. Ha engedélyezve van, egy szerver által vezérelt előnézet jelenik meg a csevegés szerkesztőmezője felett, amely megmutatja, hogyan fog kinézni az üzenet elküldéskor.<br>false - Tiltva.",
  "pvp": "Engedélyezze a PvP-t a szerveren. A magukat nyíllal lövöldöző játékosok csak akkor kapnak sebzést, ha a PvP engedélyezve van.true - A játékosok megölhetik egymást.<br>false - A játékosok nem ölhetnek meg más játékosokat (más néven Player versus Environment PvE)).<br>Megjegyzés: A játékosok által keltett közvetett sebzésforrások (például láva, tűz, TNT és bizonyos mértékig víz, homok és kavics) továbbra is kárt okoznak a többi játékosnak.",
  "query.port": "Beállítja a lekérdezőkiszolgáló portját (lásd: enable-query).",
  "rate-limit": "Beállítja, hogy a felhasználó mennyi csomagot küldhet el, mielőtt kirúgják. A 0-ra állítás letiltja ezt a funkciót.",
  "rcon.password": "Beállítja az RCON jelszavát: egy távoli konzolprotokoll, amely lehetővé teszi más alkalmazások számára, hogy csatlakozzanak egy Minecraft szerverhez, és interakcióba lépjenek az interneten keresztül.",
  "rcon.port": "Beállítja az RCON hálózati portot.",
  "resource-pack": "Opcionális URI egy erőforráscsomaghoz. A lejátszó dönthet úgy, hogy használja. Vegye figyelembe, hogy (egyes, 1.15.2 előtti verziókban) Vegye figyelembe, hogy a letöltés sikerét vagy sikertelenségét a kliens naplózza, nem pedig a szerver.",
  "resource-pack-prompt": "Opcionális, egyéni üzenetet ad hozzá, amely megjelenik az erőforráscsomag promptján, amikor a request-resource-pack használatban van. Csevegési összetevő szintaxisát várja, több sort is tartalmazhat.",
  "resource-pack-sha1": "Az erőforráscsomag opcionális SHA-1 kivonata, kisbetűs hexadecimális. Ezt ajánlott megadni, mert az erőforráscsomag integritásának ellenőrzésére szolgál.",
  "require-resource-pack": "Ha ez az opció engedélyezve van (igazra van állítva), a játékosok választ kérnek, és megszakad a kapcsolat, ha elutasítják a szükséges csomagot.",
  "server-ip": "A lejátszónak ezt be kell állítania, ha azt akarja, hogy a szerver kapcsolódjon egy adott IP-címhez. Erősen ajánlott, hogy a lejátszó hagyja üresen a server-ip értéket. Állítsa üresre, vagy azt az IP-címet, amelyet a lejátszó a szerverének szeretne fuss (hallgass) tovább.",
  "server-port": "Módosítja azt a portot, amelyen a szerver tárol (hallgat). Ezt a portot továbbítani kell, ha a szervert NAT-ot használó hálózatban tárolják (ha a lejátszónak otthoni útválasztója/tűzfala van).",
  "szimulációs távolság": "Beállítja azt a maximális távolságot a játékosoktól, ahol az élőlények elhelyezkedhetnek ahhoz, hogy a szerver frissítse őket, darabokban mérve a játékos minden irányában (sugár, nem átmérő). Ha az entitások ezen kívül esnek sugár, akkor a szerver nem fogja kipipálni őket, és a játékosok sem láthatják őket.10 az alapértelmezett/ajánlott. Ha a játékosnak jelentős lemaradása van, ezt az értéket érdemes csökkenteni.",
  "snooper-enabled": "Beállítja, hogy a szerver küldjön-e rendszeresen snoop adatokat a http://snoop.minecraft.net címre.<br>false - letiltja a snoopet.<br>true - snooping engedélyezése.",
  "spawn-animals": "Meghatározza, hogy az állatok spawn-e .",
  "spawn-monsters": "Meghatározza, hogy a szörnyek spawn-e ). Ha a nehézség nem = 0, egy szörnyeteg még mindig kiszökhet egy szörny spawnerből.<br>Ha a játékosnak jelentős lemaradása van, ajánlatos ezt kikapcsolni/hamisra állítani.",
  "spawn-npcs": "Meghatározza, hogy a falusiak spawn.true - Engedélyezve. Falusiak spawn.<br>false - Letiltva. Nincsenek falusiak.",
  "Spawn-protection": "A négyzet alakú spawn-védelmi terület oldalhosszát 2x+1-ben határozza meg. Ha 0-ra állítja, az letiltja a spawn-védelmet. Az 1-es érték egy 3×3-as négyzetet véd, amelynek középpontja az ívási pont. 2 védi az 5-öt ×5, 3 védi a 7×7-et stb. Ez az opció nem generálódik a szerver első indításakor, és akkor jelenik meg, amikor az első játékos csatlakozik. Ha nincs művelet beállítva a szerveren, a spawn védelem is automatikusan letiltásra kerül.",
  "sync-chunk-writes": "Engedélyezi a szinkron darabok írását.",
  "use-native-transport": "Linux-szerver teljesítménybeli fejlesztései: optimalizált csomagküldés/-fogadás Linuxtrue-n – Engedélyezve. Linux csomagküldés/-fogadás optimalizálás engedélyezése<br>false - Letiltva. Linux csomagküldés/-fogadás optimalizálás letiltása",
  "view-distance": "Beállítja a világadatok mennyiségét, amelyeket a szerver küld a kliensnek, darabokban mérve a lejátszó minden irányában (sugár, nem átmérő). Meghatározza a szerveroldali látótávolságot.10 az alapértelmezett/ajánlott . Ha a játékosnak jelentős lemaradása van, ezt az értéket ajánlott csökkenteni.",
  "white-list": "Engedélyezi az engedélyezési listát a szerveren. Ha engedélyezi az engedélyezési listát, a listán nem szereplő felhasználók nem tudnak csatlakozni. Magánszerverekhez készült, például valós barátok vagy idegenek számára, akiket gondosan kiválasztottak egy alkalmazási folyamat során, példa.<br><br>false – Nem használunk fehérlistát.<br>true – A whitelist.json fájlt használják a fehérlista létrehozásához.<br>Megjegyzés: A műveletek automatikusan az engedélyezési listára kerülnek, és nincs szükség vegye fel őket az engedélyezőlistára."
}